Revit 2026 API

# ScheduleFieldGridColumnWidth Property

---

The width of the column in the editable grid view, measured in feet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double GridColumnWidth { get; set; }
```
```vb
Public Property GridColumnWidth As Double
	Get
	Set
```
```cpp
public:
property double GridColumnWidth {
	double get ();
	void set (double value);
}
```
```fsharp
member GridColumnWidth : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: gridColumnWidth is negative. |

In a schedule with an embedded ScheduleDefinition, a column may display two fields, one from each ScheduleDefinition. In that case, the larger of the two widths is used.

It is always aligned with the SheetColumnWidth.

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace